Repository: rabieHs/matajir
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appName
source: Matajir
ar: متاجر

source: Categories
ar: الفئات
fr: Catégories

source: Search...
ar: بحث...
fr: Rechercher...

source: Search stores...
ar: البحث عن المتاجر...
fr: Rechercher des magasins...

source: See All
ar: عرض الكل
fr: Voir Tout

# noCategory
source: No category selected
ar: لم يتم تحديد فئة
fr: Aucune catégorie sélectionnée

source: Select Language
ar: اختر اللغة
fr: Sélectionner la langue

source: Select Country
ar: اختر البلد
fr: Sélectionner le pays

source: English
ar: الإنجليزية
fr: Anglais

source: French
ar: الفرنسية
fr: Français

source: Arabic
ar: العربية
fr: Arabe

source: Tunisia
ar: تونس
fr: Tunisie

source: United States
ar: الولايات المتحدة
fr: États-Unis

source: France
ar: فرنسا

source: Detecting location...
ar: جاري تحديد موقعك...
fr: Détection de votre position...

source: Location permission denied
ar: تم رفض إذن الموقع
fr: Permission de localisation refusée

# locationDisabled
source: Location services are disabled
ar: خدمات الموقع معطلة
fr: Les services de localisation sont désactivés

source: Home
ar: الرئيسية
fr: Accueil

source: Profile
ar: الملف الشخصي
fr: Profil

source: Settings
ar: الإعدادات
fr: Paramètres

source: Logout
ar: تسجيل الخروج
fr: Déconnexion

source: Login
ar: تسجيل الدخول
fr: Connexion

source: Register
ar: التسجيل
fr: S'inscrire

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور
fr: Mot de passe

source: Confirm Password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe

source: Phone
ar: الهاتف
fr: Téléphone

source: Address
ar: العنوان
fr: Adresse

source: City
ar: المدينة
fr: Ville

source: Country
ar: البلد
fr: Pays

source: Save
ar: حفظ
fr: Enregistrer

source: Cancel
ar: إلغاء
fr: Annuler

source: Delete
ar: حذف
fr: Supprimer

source: Error
ar: خطأ
fr: Erreur

source: Success
ar: نجح
fr: Succès

source: Close
ar: إغلاق
fr: Fermer

source: Retry
ar: إعادة المحاولة
fr: Réessayer

source: Confirm
ar: تأكيد
fr: Confirmer

source: View
ar: عرض
fr: Voir

source: View Profile
ar: عرض الملف الشخصي
fr: Voir le profil

source: Dashboard
ar: لوحة التحكم
fr: Tableau de bord

source: Stores
ar: المتاجر
fr: Magasins

source: Products
ar: المنتجات
fr: Produits

source: Orders
ar: الطلبات
fr: Commandes

source: Analytics
ar: التحليلات
fr: Analyses

source: Notifications
ar: الإشعارات

source: Help
ar: المساعدة
fr: Aide

source: Support
ar: الدعم

source: About
ar: حول
fr: À propos

source: Language
ar: اللغة
fr: Langue

# categoryClothing
source: Clothing
ar: الملابس
fr: Vêtements

# categoryFootwear
source: Footwear
ar: الأحذية
fr: Chaussures

# categoryAccessories
source: Accessories
ar: الإكسسوارات
fr: Accessoires

# categoryBeauty
source: Personal Care & Beauty
ar: العناية الشخصية والجمال
fr: Soins Personnels & Beauté

# categoryElectronics
source: Electronics & Technology
ar: الأجهزة والتقنية
fr: Électronique & Technologie

# categoryMotherChild
source: Mother & Child
ar: الأم والطفل
fr: Mère & Enfant

# categorySpecialNeeds
source: Special Needs
ar: ذوي الاحتياجات الخاصة
fr: Besoins Spéciaux

# categoryHome
source: Home & Kitchen
ar: المنزل والمطبخ
fr: Maison & Cuisine

# categorySports
source: Sports & Fitness
ar: الرياضة واللياقة

# categoryPets
source: Pets
ar: الحيوانات الأليفة
fr: Animaux de Compagnie

# categorySupermarket
source: Supermarket
ar: السوبرماركت
fr: Supermarché

# categoryBooks
source: Books & Hobbies
ar: الكتب والهوايات
fr: Livres & Loisirs

# categoryServices
source: Services
ar: الخدمات

# categoryIncense
source: Incense & Arabic Perfumes
ar: البخور والعطورات العربية
fr: Encens & Parfums Arabes

# categoryFlowers
source: Flowers
ar: الزهور
fr: Fleurs

# categoryTools
source: Tools & Supplies
ar: العدد ومستلزماتها
fr: Outils & Fournitures

# categoryDates
source: Dates & Accessories
ar: التمور وتوابعها
fr: Dattes & Accessoires

# categoryHijab
source: Hijab Fashion
ar: المحجبات
fr: Mode Hijab

# categoryTea
source: Tea & Accessories
ar: الشاي ومستلزماته
fr: Thé & Accessoires

# categoryCoffee
source: Coffee & Accessories
ar: القهوة ومستلزماتها
fr: Café & Accessoires

# categoryMiscellaneous
source: Miscellaneous Stores
ar: متاجر متنوعة
fr: Magasins Divers

# subcategoryMen
source: Men
ar: رجال
fr: Hommes

# subcategoryWomen
source: Women
ar: نساء
fr: Femmes

# subcategoryKids
source: Children
ar: أطفال
fr: Enfants

# subcategorySpecialNeeds
source: Special Needs
ar: ذوي الاحتياجات الخاصة
fr: Besoins Spéciaux

# subcategoryOther
source: Other
ar: أخرى
fr: Autres

# subcategoryMedical
source: Medical
ar: طبية
fr: Médicales

# subcategoryWatches
source: Watches
ar: ساعات
fr: Montres

# subcategoryEyewear
source: Eyewear
ar: نظارات
fr: Lunettes

# subcategoryBags
source: Bags
ar: حقائب
fr: Sacs

# subcategoryJewelry
source: Jewelry
ar: مجوهرات
fr: Bijoux

# subcategoryHeadwear
source: Headwear
ar: أغطية رأس
fr: Couvre-chefs

# subcategorySkincare
source: Skincare
ar: العناية بالبشرة
fr: Soins de la Peau

# subcategoryHaircare
source: Haircare
ar: العناية بالشعر
fr: Soins des Cheveux

# subcategoryMakeup
source: Makeup
ar: مكياج
fr: Maquillage

# subcategoryPerfumes
source: Perfumes
ar: عطور
fr: Parfums

# subcategoryBathProducts
source: Bath Products
ar: منتجات استحمام
fr: Produits de Bain

# subcategoryPhones
source: Phones
ar: هواتف
fr: Téléphones

# subcategoryLaptops
source: Laptops
ar: لابتوبات
fr: Ordinateurs Portables

# subcategoryTablets
source: Tablets
ar: أجهزة لوحية
fr: Tablettes

# subcategoryTechAccessories
source: Tech Accessories
ar: ملحقات تقنية
fr: Accessoires Tech

# subcategoryGaming
source: Gaming
ar: ألعاب إلكترونية
fr: Jeux Électroniques

# subcategoryBabyEssentials
source: Baby Essentials
ar: مستلزمات الرضع
fr: Articles pour Bébé

# subcategoryMaternity
source: Maternity
ar: الحوامل
fr: Maternité

# subcategoryStrollers
source: Strollers
ar: عربات أطفال
fr: Poussettes

# subcategoryCarSeats
source: Car Seats
ar: كرسي سيارة
fr: Sièges Auto

# subcategoryEducationalToys
source: Educational Toys
ar: ألعاب تعليمية
fr: Jouets Éducatifs

# subcategoryMedicalDevices
source: Medical Devices
ar: الأجهزة الطبية
fr: Appareils Médicaux

# subcategorySpecializedClothing
source: Specialized Clothing
ar: الملابس المخصصة
fr: Vêtements Spécialisés

# subcategoryAssistiveTools
source: Assistive Tools
ar: الأدوات المساعدة
fr: Outils d'Assistance

# subcategoryAssistiveTech
source: Assistive Technology
ar: التقنيات المساعدة
fr: Technologies d'Assistance

# subcategorySpecialActivities
source: Special Activities & Games
ar: الألعاب والأنشطة الخاصة
fr: Activités & Jeux Spéciaux

# subcategoryFurniture
source: Furniture
ar: أثاث
fr: Meubles

# subcategoryHomeAppliances
source: Home Appliances
ar: أجهزة منزلية
fr: Appareils Ménagers

# subcategoryKitchenTools
source: Kitchen Tools
ar: أدوات مطبخ
fr: Ustensiles de Cuisine

# subcategoryTextiles
source: Textiles
ar: مفروشات

# subcategoryDecor
source: Decor
ar: ديكور
fr: Décoration

# subcategorySportswear
source: Sportswear
ar: ملابس رياضية
fr: Vêtements de Sport

# subcategorySportsEquipment
source: Sports Equipment
ar: معدات رياضية
fr: Équipement Sportif

# subcategoryFitnessDevices
source: Fitness Devices
ar: أجهزة لياقة
fr: Appareils de Fitness

# subcategorySupplements
source: Supplements
ar: مكملات غذائية
fr: Compléments Alimentaires

# subcategoryPetFood
source: Pet Food
ar: أطعمة
fr: Nourriture

# subcategoryPetToys
source: Pet Toys
ar: ألعاب
fr: Jouets

# subcategoryPetGrooming
source: Pet Grooming
ar: أدوات عناية
fr: Toilettage

# subcategoryPetCages
source: Pet Cages
ar: أقفاص
fr: Cages

# subcategoryFreshProducts
source: Fresh Products
ar: منتجات طازجة
fr: Produits Frais

# subcategoryCannedGoods
source: Canned Goods
ar: معلبات
fr: Conserves

# subcategoryBeverages
source: Beverages
ar: مشروبات
fr: Boissons

# subcategoryCleaningProducts
source: Cleaning Products
ar: منظفات
fr: Produits de Nettoyage

# subcategoryOrganicProducts
source: Organic Products
ar: منتجات عضوية
fr: Produits Bio

# subcategoryBooks
source: Books
ar: كتب
fr: Livres

# subcategoryArtSupplies
source: Art Supplies
ar: أدوات فنية
fr: Fournitures d'Art

# subcategoryMusicalInstruments
source: Musical Instruments
ar: آلات موسيقية
fr: Instruments de Musique

# subcategoryBrainGames
source: Brain Games
ar: ألعاب ذهنية
fr: Jeux de Réflexion

# subcategoryGiftCards
source: Gift Cards
ar: بطاقات هدايا
fr: Cartes Cadeaux

# subcategorySubscriptions
source: Subscriptions
ar: اشتراكات
fr: Abonnements

# subcategoryRepair
source: Repair & Maintenance
ar: تصليح وصيانة
fr: Réparation & Entretien

# subcategoryConsultations
source: Consultations
ar: استشارات

# subcategoryIncense
source: Incense
ar: بخور
fr: Encens

# subcategoryOudOil
source: Oud Oil
ar: دهن عود
fr: Huile d'Oud

# subcategoryMamool
source: Mamool
ar: معمول
fr: Mamoul

# subcategoryOrientalPerfumes
source: Oriental Perfumes
ar: عطور شرقية
fr: Parfums Orientaux

# subcategoryNaturalFlowers
source: Natural Flowers
ar: زهور طبيعية
fr: Fleurs Naturelles

# subcategoryArtificialFlowers
source: Artificial Flowers
ar: زهور صناعية
fr: Fleurs Artificielles

# subcategoryArrangements
source: Arrangements
ar: تنسيقات
fr: Compositions

# subcategoryArrangementSupplies
source: Arrangement Supplies
ar: مستلزمات تنسيق
fr: Fournitures d'Arrangement

# subcategoryHandTools
source: Hand Tools
ar: عدد يدوية
fr: Outils Manuels

# subcategoryPowerTools
source: Power Tools
ar: معدات كهربائية
fr: Outils Électriques

# subcategoryMaintenanceSupplies
source: Maintenance Supplies
ar: مستلزمات صيانة
fr: Fournitures d'Entretien

# subcategorySafetyEquipment
source: Safety Equipment
ar: معدات السلامة
fr: Équipement de Sécurité

# subcategoryDateVarieties
source: Date Varieties
ar: أنواع التمور
fr: Variétés de Dattes

# subcategoryDateProducts
source: Date Products
ar: منتجات التمر
fr: Produits de Dattes

# subcategoryDatePackaging
source: Date Packaging
ar: تغليف وتقديم التمور
fr: Emballage de Dattes

# subcategoryDateGifts
source: Date Gifts
ar: هدايا التمور
fr: Cadeaux de Dattes

# subcategoryHijabClothing
source: Hijab Clothing
ar: ملابس محجبات
fr: Vêtements Hijab

# subcategoryHeadscarves
source: Headscarves
ar: أغطية رأس
fr: Foulards

# subcategoryHijabAccessories
source: Hijab Accessories
ar: إكسسوارات
fr: Accessoires

# subcategorySportsHijab
source: Sports Hijab
ar: حجاب الرياضة
fr: Hijab de Sport

# subcategoryHerbalTea
source: Herbal Tea
ar: شاي أعشاب
fr: Thé aux Herbes

# subcategoryTraditionalTea
source: Traditional Tea
ar: شاي تقليدي
fr: Thé Traditionnel

# subcategoryPremiumTea
source: Premium Tea
ar: شاي فاخر
fr: Thé Premium

# subcategoryTeaPreparation
source: Tea Preparation
ar: مستلزمات تحضير الشاي
fr: Préparation du Thé

# subcategoryArabicCoffee
source: Arabic Coffee
ar: قهوة عربية
fr: Café Arabe

# subcategoryEspresso
source: Espresso
ar: قهوة إسبريسو

# subcategoryFrenchPress
source: French Press
ar: قهوة فرنسية
fr: Café à la Française

# subcategoryCoffeePreparation
source: Coffee Preparation
ar: مستلزمات تحضير القهوة
fr: Préparation du Café

source: Stores Nearby
ar: متاجر قريبة
fr: Magasins à proximité

source: Promoted Stores
ar: متاجر مميزة
fr: Magasins en vedette

source: All Stores
ar: جميع المتاجر
fr: Tous les magasins

source: Change Location
ar: تغيير الموقع
fr: Changer d'emplacement

source: Favorites
ar: المفضلة
fr: Favoris

source: Advertise with us
ar: أعلن معنا
fr: Annoncez avec nous

# pleaseLoginToAdvertise
source: Please log in to advertise with us
ar: يرجى تسجيل الدخول للإعلان
fr: Veuillez vous connecter pour faire de la publicité

# loginRequiredForAds
source: You need to be logged in to create and manage advertisements
ar: تحتاج إلى تسجيل الدخول لإنشاء وإدارة الإعلانات
fr: Vous devez être connecté pour créer et gérer des publicités

# advertiseYourBusiness
source: Advertise your business on Matajir
ar: أعلن عن عملك
fr: Annoncez Votre Entreprise

# reachPotentialCustomers
source: Reach thousands of potential customers by advertising on our platform
ar: الوصول إلى آلاف العملاء المحتملين من خلال الإعلان على منصتنا
fr: Atteignez des milliers de clients potentiels en faisant de la publicité sur notre plateforme

# chooseAdvertisingPackage
source: Choose an advertising package
ar: اختر باقة إعلانية
fr: Choisissez un forfait publicitaire

source: Benefits
ar: المزايا
fr: Avantages

source: Pricing Plans
ar: خطط التسعير
fr: Plans tarifaires

source: Home Spotlight
ar: إضاءة الصفحة الرئيسية
fr: Spotlight Accueil

# homeSpotlightPrice
source: $50 / week
ar: 50$ / أسبوع
fr: 50$ / semaine

# homeSpotlightDescription
source: Show your ad on the app's homepage for maximum visibility.
ar: اعرض إعلانك على الصفحة الرئيسية للتطبيق للحصول على أقصى قدر من الرؤية.
fr: Affichez votre annonce sur la page d'accueil de l'application pour une visibilité maximale.

source: Home Spotlight Advertisement
ar: إعلان إضاءة الصفحة الرئيسية
fr: Publicité Spotlight Accueil

source: Home Spotlight Details
ar: تفاصيل إضاءة الصفحة الرئيسية
fr: Détails du Spotlight Accueil

source: Category Match
ar: مطابقة الفئة
fr: Correspondance de Catégorie

# categoryMatchPrice
source: $30 / week
ar: 30$ / أسبوع
fr: 30$ / semaine

# categoryMatchDescription
source: Display your ad in a selected category, reaching users actively browsing that section.
ar: اعرض إعلانك في فئة محددة، للوصول إلى المستخدمين الذين يتصفحون هذا القسم بنشاط.
fr: Affichez votre annonce dans une catégorie sélectionnée, atteignant les utilisateurs qui naviguent activement dans cette section.

source: Category Match Advertisement
ar: إعلان مطابقة الفئة
fr: Publicité Correspondance de Catégorie

source: Category Selection
ar: اختيار الفئة
fr: Sélection de Catégorie

source: Select Category
ar: اختر الفئة
fr: Sélectionner une catégorie

source: Select Subcategory
ar: اختر الفئة الفرعية
fr: Sélectionner une Sous-catégorie

# selectCategoryFirst
source: Select a category first
ar: اختر فئة أولاً
fr: Sélectionnez d'abord une catégorie

# pleaseSelectCategory
source: Please select a category
ar: يرجى اختيار فئة
fr: Veuillez sélectionner une catégorie

source: Top Store Boost
ar: تعزيز المتجر
fr: Boost de Magasin

# topStoreBoostPrice
source: $40 / week
ar: 40$ / أسبوع
fr: 40$ / semaine

# topStoreBoostDescription
source: Promote your store at the top of search results and in the promoted stores list.
ar: قم بترويج متجرك في أعلى نتائج البحث وفي قائمة المتاجر المميزة.
fr: Promouvez votre magasin en haut des résultats de recherche et dans la liste des magasins mis en avant.

source: Top Store Boost Advertisement
ar: إعلان تعزيز المتجر
fr: Publicité Boost de Magasin

source: Store Selection
ar: اختيار المتجر
fr: Sélection de Magasin

source: Select Store to Promote
ar: اختر متجرًا للترويج
fr: Sélectionnez un magasin à promouvoir

source: Select Store
ar: اختر متجرًا
fr: Sélectionner un magasin

source: No stores found
ar: لم يتم العثور على متاجر
fr: Aucun magasin trouvé

# createStoreFirst
source: Create a store first to promote it
ar: قم بإنشاء متجر أولاً للترويج له
fr: Créez d'abord un magasin pour le promouvoir

source: My Stores
ar: متاجري
fr: Mes Magasins

source: My Ads
ar: إعلاناتي
fr: Mes Publicités

source: Add Store
ar: إضافة متجر
fr: Ajouter un magasin

# storeLogoUsed
source: Your store logo will be used as the advertisement image
ar: سيتم استخدام شعار متجرك كصورة للإعلان
fr: Le logo de votre magasin sera utilisé comme image publicitaire

# pleaseSelectStore
source: Please select a store to promote
ar: يرجى اختيار متجر للترويج
fr: Veuillez sélectionner un magasin à promouvoir

source: Advertisement Image
ar: صورة الإعلان
fr: Image Publicitaire

# recommendedImageSize
source: Recommended image size: {size}
ar: الحجم الموصى به للصورة: {size}
fr: Taille d'image recommandée: {size}

# tapToUploadImage
source: Tap to upload
ar: انقر للتحميل
fr: Appuyez pour télécharger

source: Change image
ar: تغيير الصورة
fr: Changer l'image

source: Advertisement Details
ar: تفاصيل الإعلان
fr: Détails de la Publicité

source: Advertisement Name
ar: اسم الإعلان
fr: Nom de la Publicité

# enterAdvertisementName
source: Enter a name for your advertisement
ar: أدخل اسمًا لإعلانك
fr: Entrez un nom pour votre publicité

source: Click URL
ar: رابط النقر
fr: URL de Clic

# enterClickUrl
source: Enter the URL where users will be directed when they click your ad
ar: أدخل عنوان URL الذي سيتم توجيه المستخدمين إليه عند النقر على إعلانك
fr: Entrez l'URL vers laquelle les utilisateurs seront dirigés lorsqu'ils cliqueront sur votre annonce

source: Duration
ar: المدة
fr: Durée

source: Week
ar: أسبوع
fr: Semaine

source: Day
ar: يوم
fr: Jour

source: Create Advertisement
ar: إنشاء إعلان
fr: Créer une Publicité

# advertisementCreatedSuccess
source: Advertisement created successfully!
ar: تم إنشاء الإعلان بنجاح!
fr: Publicité créée avec succès!

# storePromotionCreatedSuccess
source: Store promotion created successfully!
ar: تم إنشاء ترويج المتجر بنجاح!
fr: Promotion du magasin créée avec succès!

source: Failed to create advertisement
ar: فشل في إنشاء الإعلان
fr: Échec de la création de la publicité

source: Failed to create store promotion
ar: فشل في إنشاء ترويج المتجر
fr: Échec de la création de la promotion du magasin

# thisFieldRequired
source: This field is required
ar: هذا الحقل مطلوب
fr: Ce champ est requis

source: Create
ar: إنشاء
fr: Créer

# pleaseSelectImage
source: Please select an image
ar: يرجى اختيار صورة
fr: Veuillez sélectionner une image

source: Failed to upload image
ar: فشل في تحميل الصورة
fr: Échec du téléchargement de l'image

# invalidUrl
source: Please enter a valid URL
ar: يرجى إدخال عنوان URL صالح
fr: Veuillez entrer une URL valide

source: No Stores Yet
ar: لا توجد متاجر حتى الآن
fr: Pas encore de magasins

# createYourFirstStore
source: Create your first store to start selling your products
ar: أنشئ متجرك الأول لبدء بيع منتجاتك
fr: Créez votre premier magasin pour commencer à vendre vos produits

source: Add New Store
ar: إضافة متجر جديد
fr: Ajouter un nouveau magasin

# createStoreDescription
source: Create a new store to showcase your products
ar: إنشاء متجر جديد لعرض منتجاتك
fr: Créer un nouveau magasin pour présenter vos produits

source: Edit Store
ar: تعديل المتجر
fr: Modifier le magasin

source: View Details
ar: عرض التفاصيل
fr: Voir les détails

source: Delete Store
ar: حذف المتجر
fr: Supprimer le magasin

# deleteStoreConfirmation
source: Are you sure you want to delete {storeName}?
ar: هل أنت متأكد أنك تريد حذف {storeName}؟
fr: Êtes-vous sûr de vouloir supprimer {storeName}?

# storeDeleted
source: {storeName} has been deleted
ar: تم حذف {storeName}
fr: {storeName} a été supprimé

source: Store Name
ar: اسم المتجر
fr: Nom du magasin

# storeNameRequired
source: Store name is required
ar: اسم المتجر مطلوب
fr: Le nom du magasin est requis

# storeSecondName
source: Store Second Name (Optional)
ar: الاسم الثاني للمتجر (اختياري)
fr: Second nom du magasin (Optionnel)

source: Store Description
ar: وصف المتجر
fr: Description du magasin

source: Store Logo
ar: شعار المتجر
fr: Logo du magasin

source: Tap to upload
ar: انقر للتحميل
fr: Appuyez pour télécharger

source: Basic Information
ar: المعلومات الأساسية
fr: Informations de base

source: Contact Information
ar: معلومات الاتصال
fr: Informations de contact

source: Location
ar: الموقع
fr: Emplacement

source: Use Current Location
ar: استخدام الموقع الحالي
fr: Utiliser l'emplacement actuel

source: Store Banners
ar: لافتات المتجر
fr: Bannières du magasin

# storeBannersDescription
source: Add up to 4 banner images for your store (recommended size: 1200x400)
ar: أضف ما يصل إلى 4 صور لافتة لمتجرك (الحجم الموصى به: 1200 × 400)
fr: Ajoutez jusqu'à 4 images de bannière pour votre magasin (taille recommandée: 1200 x 400)

source: Add Banner
ar: إضافة لافتة
fr: Ajouter une bannière

source: Banners
ar: اللافتات
fr: Bannières

source: Social Links
ar: روابط التواصل الاجتماعي
fr: Liens sociaux

# socialLinksDescription
source: Add your social media links to connect with customers
ar: أضف روابط وسائل التواصل الاجتماعي الخاصة بك للتواصل مع العملاء
fr: Ajoutez vos liens de médias sociaux pour vous connecter avec les clients

source: Platform
ar: المنصة
fr: Plateforme

source: URL
ar: الرابط

source: Add Social Link
ar: إضافة رابط اجتماعي
fr: Ajouter un lien social

source: Create Store
ar: إنشاء متجر
fr: Créer un magasin

source: Update Store
ar: تحديث المتجر
fr: Mettre à jour le magasin

# storeCreated
source: Store created successfully
ar: تم إنشاء المتجر بنجاح
fr: Magasin créé avec succès

# storeUpdated
source: Store updated successfully
ar: تم تحديث المتجر بنجاح
fr: Magasin mis à jour avec succès

# storeCreationFailed
source: Failed to create store
ar: فشل في إنشاء المتجر
fr: Échec de la création du magasin

# storeUpdateFailed
source: Failed to update store
ar: فشل في تحديث المتجر
fr: Échec de la mise à jour du magasin

source: Website
ar: الموقع الإلكتروني
fr: Site web

# invalidWebsite
source: Please enter a valid website URL
ar: يرجى إدخال عنوان URL صالح للموقع
fr: Veuillez entrer une URL de site web valide

source: Optional
ar: اختياري
fr: Optionnel

source: Description
ar: الوصف

source: Verified
ar: موثق
fr: Vérifié

source: Pending
ar: قيد الانتظار
fr: En attente

# noBanners
source: No banners available
ar: لا توجد لافتات متاحة
fr: Aucune bannière disponible

source: Store Information
ar: معلومات المتجر
fr: Informations du magasin

source: Created At
ar: تم الإنشاء في
fr: Créé le

source: Published At
ar: تم النشر في
fr: Publié le

source: Last Updated
ar: آخر تحديث
fr: Dernière mise à jour

source: Instagram
ar: انستغرام

source: Facebook
ar: فيسبوك

source: Twitter
ar: تويتر

source: YouTube
ar: يوتيوب

source: TikTok
ar: تيك توك

source: Location permission permanently denied
ar: تم رفض إذن الموقع بشكل دائم
fr: Permission de localisation refusée de façon permanente

source: Open Settings
ar: فتح الإعدادات
fr: Ouvrir les paramètres

# locationError
source: Error getting location
ar: خطأ في الحصول على الموقع
fr: Erreur lors de l'obtention de l'emplacement

# logoUploaded
source: Logo uploaded successfully
ar: تم تحميل الشعار بنجاح
fr: Logo téléchargé avec succès

# bannerAdded
source: Banner added successfully
ar: تمت إضافة اللافتة بنجاح
fr: Bannière ajoutée avec succès

source: Login required
ar: تسجيل الدخول مطلوب
fr: Connexion requise

source: Algeria
ar: الجزائر
fr: Algérie

source: Morocco
ar: المغرب
fr: Maroc

source: Libya
ar: ليبيا
fr: Libye

source: Egypt
ar: مصر
fr: Égypte

source: Features
ar: المميزات
fr: Caractéristiques

source: Subscribe Now
ar: اشترك الآن
fr: S'abonner maintenant

source: Ad Example
ar: مثال الإعلان
fr: Exemple d'annonce

# howAdWillAppear
source: How your ad will appear on the home screen
ar: كيف سيظهر إعلانك على الشاشة الرئيسية
fr: Comment votre annonce apparaîtra sur l'écran d'accueil

source: Featured Ad
ar: إعلان مميز
fr: Annonce en vedette

source: Best For
ar: الأفضل لـ
fr: Idéal pour

source: New Store Launch
ar: إطلاق متجر جديد
fr: Lancement de nouveau magasin

# newStoreLaunchDesc
source: Perfect for announcing your new store to all users
ar: مثالي للإعلان عن متجرك الجديد لجميع المستخدمين
fr: Parfait pour annoncer votre nouveau magasin à tous les utilisateurs

source: Special Promotions
ar: عروض خاصة
fr: Promotions spéciales

# specialPromotionsDesc
source: Ideal for limited-time offers and seasonal sales
ar: مثالي للعروض المحدودة والمبيعات الموسمية
fr: Idéal pour les offres à durée limitée et les soldes saisonnières

source: Brand Awareness
ar: الوعي بالعلامة التجارية
fr: Notoriété de la marque

# brandAwarenessDesc
source: Great for increasing visibility and recognition
ar: رائع لزيادة الرؤية والتعرف على علامتك التجارية
fr: Excellent pour augmenter la visibilité et la reconnaissance

# ecommerceBusiness
source: E-commerce Businesses
ar: أعمال التجارة الإلكترونية
fr: Entreprises e-commerce

# ecommerceBusinessDesc
source: Ideal for stores with a wide range of products
ar: مثالي للمتاجر ذات مجموعة واسعة من المنتجات
fr: Idéal pour les magasins avec une large gamme de produits
