Repository: rabieHs/matajir
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Premium Brands
ar: العلامات التجارية الفاخرة
fr: Marques premium

# premiumBrandsDesc
source: Great for luxury and premium brands seeking quality exposure
ar: رائع للعلامات التجارية الفاخرة والمميزة التي تبحث عن ظهور عالي الجودة
fr: Excellent pour les marques de luxe et premium recherchant une exposition de qualité

source: New Product Launch
ar: إطلاق منتج جديد
fr: Lancement de nouveau produit

# newProductLaunchDesc
source: Ideal for introducing new products to interested customers
ar: مثالي لتقديم منتجات جديدة للعملاء المهتمين
fr: Idéal pour présenter de nouveaux produits aux clients intéressés

source: Category Leaders
ar: رواد الفئة
fr: Leaders de catégorie

# categoryLeadersDesc
source: Great for establishing your brand as a category leader
ar: رائع لتأسيس علامتك التجارية كرائد في الفئة
fr: Excellent pour établir votre marque comme leader de catégorie

source: Performance Metrics
ar: مقاييس الأداء
fr: Métriques de performance

source: Niche Products
ar: منتجات متخصصة
fr: Produits de niche

# nicheProductsDesc
source: Perfect for specialized products with a specific audience
ar: مثالي للمنتجات المتخصصة ذات الجمهور المحدد
fr: Parfait pour les produits spécialisés avec un public spécifique

source: Established Stores
ar: متاجر راسخة
fr: Magasins établis

# establishedStoresDesc
source: Perfect for stores looking to maintain market leadership
ar: مثالي للمتاجر التي تسعى للحفاظ على ريادتها في السوق
fr: Parfait pour les magasins cherchant à maintenir leur leadership sur le marché

# homeSpotlightFeature1
source: Featured placement on the home screen
ar: مكان مميز على الشاشة الرئيسية
fr: Placement en vedette sur l'écran d'accueil

# homeSpotlightFeature2
source: Visible to all app users
ar: مرئي لجميع مستخدمي التطبيق
fr: Visible pour tous les utilisateurs de l'application

# homeSpotlightFeature3
source: High-quality image display
ar: عرض صور عالية الجودة
fr: Affichage d'images de haute qualité

# homeSpotlightFeature4
source: Direct link to your store or website
ar: رابط مباشر إلى متجرك أو موقعك الإلكتروني
fr: Lien direct vers votre magasin ou site web

# homeSpotlightFeature5
source: Weekly performance analytics
ar: تحليلات الأداء الأسبوعية
fr: Analyses de performance hebdomadaires

# homeSpotlightFeature6
source: Priority customer support
ar: دعم عملاء ذو أولوية
fr: Support client prioritaire

# categoryMatchFeature1
source: Targeted placement in a category of your choice
ar: مكان مستهدف في فئة من اختيارك
fr: Placement ciblé dans une catégorie de votre choix

# categoryMatchFeature2
source: Reach users with specific interests
ar: الوصول إلى المستخدمين ذوي الاهتمامات المحددة
fr: Atteindre les utilisateurs avec des intérêts spécifiques

# categoryMatchFeature3
source: Appear in category browsing results
ar: الظهور في نتائج تصفح الفئات
fr: Apparaître dans les résultats de navigation par catégorie

# categoryMatchFeature4
source: Direct link to your store or website
ar: رابط مباشر إلى متجرك أو موقعك الإلكتروني
fr: Lien direct vers votre magasin ou site web

# categoryMatchFeature5
source: Weekly performance analytics
ar: تحليلات الأداء الأسبوعية
fr: Analyses de performance hebdomadaires

# categoryMatchFeature6
source: Priority customer support
ar: دعم عملاء ذو أولوية
fr: Support client prioritaire

# topStoreBoostFeature1
source: Priority placement in search results
ar: مكان ذو أولوية في نتائج البحث
fr: Placement prioritaire dans les résultats de recherche

# topStoreBoostFeature2
source: Featured in "Promoted Stores" section
ar: متميز في قسم "المتاجر المميزة"
fr: Mis en avant dans la section "Magasins promus"

# topStoreBoostFeature3
source: Highlighted store card with special badge
ar: بطاقة متجر مميزة بشارة خاصة
fr: Carte de magasin mise en évidence avec badge spécial

# topStoreBoostFeature4
source: Increased visibility across the app
ar: زيادة الرؤية في جميع أنحاء التطبيق
fr: Visibilité accrue dans toute l'application

# topStoreBoostFeature5
source: Weekly performance analytics
ar: تحليلات الأداء الأسبوعية
fr: Analyses de performance hebdomadaires

# topStoreBoostFeature6
source: Detailed customer engagement metrics
ar: مقاييس تفاعل العملاء المفصلة
fr: Métriques détaillées d'engagement client

source: Existing Advertisement
ar: إعلان موجود
fr: Publicité existante

# existingAdMessage
source: You already have an active store boost advertisement for "{storeName}". You can extend the ad period in the My Ads section.
ar: لديك بالفعل إعلان تعزيز متجر نشط لـ "{storeName}". يمكنك تمديد فترة الإعلان في قسم إعلاناتي.
fr: Vous avez déjà une publicité de promotion de magasin active pour "{storeName}". Vous pouvez prolonger la période publicitaire dans la section Mes Publicités.

source: Go to My Ads
ar: الذهاب إلى إعلاناتي
fr: Aller à Mes Publicités

source: User not authenticated
ar: المستخدم غير مصادق عليه
fr: Utilisateur non authentifié

# storePromotionInfo
source: Your store will be promoted in search results and category listings. No image upload needed - we'll use your store logo.
ar: سيتم ترويج متجرك في نتائج البحث وقوائم الفئات. لا حاجة لتحميل صورة - سنستخدم شعار متجرك.
fr: Votre magasin sera promu dans les résultats de recherche et les listes de catégories. Pas besoin de télécharger d'image - nous utiliserons le logo de votre magasin.

source: Category
ar: الفئة
fr: Catégorie

# subcategoriesMultiple
source: Subcategories (Multiple Selection)
ar: الفئات الفرعية (اختيار متعدد)
fr: Sous-catégories (Sélection multiple)

# pleaseSelectCategoryFirst
source: Please select a category first
ar: يرجى اختيار فئة أولاً
fr: Veuillez d'abord sélectionner une catégorie

# noCategoriesAvailable
source: No categories available. Please try again later.
ar: لا توجد فئات متاحة. يرجى المحاولة مرة أخرى لاحقاً.
fr: Aucune catégorie disponible. Veuillez réessayer plus tard.

# selectSubcategories
source: Select Subcategories (Multiple)
ar: اختر الفئات الفرعية (متعدد)
fr: Sélectionner les sous-catégories (Multiple)

# noSubcategoriesAvailable
source: No subcategories available for this category.
ar: لا توجد فئات فرعية متاحة لهذه الفئة.
fr: Aucune sous-catégorie disponible pour cette catégorie.

source: Select State/Province
ar: اختر الولاية/المقاطعة
fr: Sélectionner l'État/Province

source: Need Help?
ar: تحتاج مساعدة؟
fr: Besoin d'aide?

source: Continue
ar: متابعة
fr: Continuer

# operationCompleted
source: Operation completed successfully
ar: تمت العملية بنجاح
fr: Opération terminée avec succès

# chatbotTitle
source: AI Assistant
ar: مساعد ذكي
fr: Assistant IA

# chatbotSubtitle
source: Ask me anything about Matajir
ar: اسألني أي شيء عن متاجر
fr: Demandez-moi tout sur Matajir

# chatbotWelcome
source: Hello! I'm your Matajir assistant. I'm here to help you with any questions about using the app, creating stores, managing advertisements, and more!
ar: مرحباً! أنا مساعدك في متاجر. أنا هنا لمساعدتك في أي أسئلة حول استخدام التطبيق، وإنشاء المتاجر، وإدارة الإعلانات، والمزيد!
fr: Bonjour! Je suis votre assistant Matajir. Je suis là pour vous aider avec toutes vos questions sur l'utilisation de l'application, la création de magasins, la gestion des publicités, et plus encore!

# chatbotSuggestedQuestions
source: Here are some questions you might want to ask:
ar: إليك بعض الأسئلة التي قد تريد طرحها:
fr: Voici quelques questions que vous pourriez vouloir poser:

# chatbotQuestion1
source: How do I create a store?
ar: كيف أنشئ متجراً؟
fr: Comment créer un magasin?

# chatbotQuestion2
source: What types of advertisements can I create?
ar: ما أنواع الإعلانات التي يمكنني إنشاؤها؟
fr: Quels types de publicités puis-je créer?

# chatbotQuestion3
source: How do I promote my store?
ar: كيف أروج لمتجري؟
fr: Comment promouvoir mon magasin?

# chatbotQuestion4
source: How does the payment system work?
ar: كيف يعمل نظام الدفع؟
fr: Comment fonctionne le système de paiement?

# chatbotError
source: I'm sorry, I'm having trouble responding right now. Please try again or contact our support team for assistance.
ar: أعتذر، أواجه صعوبة في الرد الآن. يرجى المحاولة مرة أخرى أو التواصل مع فريق الدعم للمساعدة.
fr: Désolé, j'ai des difficultés à répondre en ce moment. Veuillez réessayer ou contacter notre équipe de support pour obtenir de l'aide.

# chatbotTyping
source: AI is typing...
ar: الذكاء الاصطناعي يكتب...
fr: L'IA tape...

# chatbotInputHint
source: Type your message here...
ar: اكتب رسالتك هنا...
fr: Tapez votre message ici...

# supportSubtitle
source: We're here to help you
ar: نحن هنا لمساعدتك
fr: Nous sommes là pour vous aider

# supportWelcome
source: Welcome to Matajir Support!
ar: مرحباً بك في دعم متاجر!
fr: Bienvenue au support Matajir!

# supportDescription
source: Our team is ready to assist you with any questions or issues you may have.
ar: فريقنا جاهز لمساعدتك في أي أسئلة أو مشاكل قد تواجهها.
fr: Notre équipe est prête à vous aider avec toutes vos questions ou problèmes.

source: Contact Methods
ar: طرق التواصل
fr: Méthodes de contact

source: Email Support
ar: دعم البريد الإلكتروني
fr: Support par e-mail

# emailSupportDesc
source: Send us an email and we'll respond within 24 hours
ar: أرسل لنا بريداً إلكترونياً وسنرد عليك خلال 24 ساعة
fr: Envoyez-nous un e-mail et nous répondrons dans les 24 heures

source: Phone Support
ar: دعم هاتفي
fr: Support téléphonique

# phoneSupportDesc
source: Call us directly for immediate assistance
ar: اتصل بنا مباشرة للحصول على مساعدة فورية
fr: Appelez-nous directement pour une assistance immédiate

source: WhatsApp Support
ar: دعم واتساب
fr: Support WhatsApp

# whatsappSupportDesc
source: Chat with us on WhatsApp for quick help
ar: تحدث معنا عبر واتساب للحصول على مساعدة سريعة
fr: Chattez avec nous sur WhatsApp pour une aide rapide

source: Follow Us
ar: تابعنا
fr: Suivez-nous

# faq
source: Frequently Asked Questions
ar: الأسئلة الشائعة
fr: Questions fréquemment posées

# faqDescription
source: Find answers to common questions about using Matajir
ar: اعثر على إجابات للأسئلة الشائعة حول استخدام متاجر
fr: Trouvez des réponses aux questions courantes sur l'utilisation de Matajir

source: View FAQ
ar: عرض الأسئلة الشائعة
fr: Voir la FAQ

source: Update Profile
ar: تحديث الملف الشخصي
fr: Mettre à jour le profil

source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!
fr: Profil mis à jour avec succès!

source: Tap to change photo
ar: اضغط لتغيير الصورة
fr: Appuyez pour changer la photo

source: Store Owner
ar: مالك متجر
fr: Propriétaire de magasin

# storeOwnerDescription
source: Enable this to create and manage stores
ar: فعّل هذا لإنشاء وإدارة المتاجر
fr: Activez ceci pour créer et gérer des magasins

source: Danger Zone
ar: منطقة الخطر
fr: Zone de danger

# dangerZoneDescription
source: Actions in this section are irreversible. Please proceed with caution.
ar: الإجراءات في هذا القسم غير قابلة للتراجع. يرجى المتابعة بحذر.
fr: Les actions dans cette section sont irréversibles. Veuillez procéder avec prudence.

source: Delete Account
ar: حذف الحساب
fr: Supprimer le compte

# deleteAccountConfirmation
source: Are you sure you want to delete your account? This action cannot be undone and all your data will be permanently lost.
ar: هل أنت متأكد من رغبتك في حذف حسابك؟ هذا الإجراء لا يمكن التراجع عنه وسيتم فقدان جميع بياناتك نهائياً.
fr: Êtes-vous sûr de vouloir supprimer votre compte? Cette action ne peut pas être annulée et toutes vos données seront définitivement perdues.

source: Feature Not Available
ar: الميزة غير متاحة
fr: Fonctionnalité non disponible

# accountDeletionNotImplemented
source: Account deletion is not yet implemented. Please contact support for assistance.
ar: حذف الحساب غير متاح حالياً. يرجى التواصل مع الدعم للمساعدة.
fr: La suppression de compte n'est pas encore implémentée. Veuillez contacter le support pour obtenir de l'aide.

# noFavorites
source: No Favorites Yet
ar: ليس لديك متاجر مفضلة
fr: Vous n'avez pas de magasins favoris
